20210123181413-elfeed-org.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://jasbrg.github.io/rss.xml"
      title="RSS feed for https://jasbrg.github.io/">
<title>elfeed-org</title>
<meta name="author" content="Jacob Sonnenberg">
<meta name="referrer" content="no-referrer">
<link href="https://sandyuraz.com/styles/org.min.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://jasbrg.github.io">My Static Org Blog</a>
</div></div>
<div id="content">
<div class="post-date">23 Jan 2021</div><h1 class="post-title"><a href="https://jasbrg.github.io/20210123181413-elfeed-org.html">elfeed-org</a></h1>
<p>
Today I went on a little bit of a rabbit hole when configuring my RSS feeds to
please <code>elfeed-org</code>. Its configuration is simple enough, a normal org file where
the headings are feed URLs for <code>elfeed</code>, and the tags are tags and inherited
normally. Also, org-links are valid and understood. Cool!
</p>

<p>
Then I tried fitting YouTube channels into this routine, but that wasn't quite
as trivial. After some experimentation with scripts and <a href="https://en.wikipedia.org/wiki/Bookmarklet">bookmarklets</a> the
solution I ended up using was to just find and copy the relevant URL
programmatically with a <a href="https://greasyfork.org/en/scripts/36357-youtube-copy-channel-rss-feed-url-to-clipboard">user-script</a> called through <a href="https://www.tampermonkey.net/">Tampermonkey</a>. It needed a
small modification, adding
</p>

<p>
<code>// @match        https://www.youtube.com/c/*</code>
</p>

<p>
to include the apparantly new shortened URLs, there may be more edge cases
lurking.
</p>

<p>
Then, I have a couple of entries added to <code>org-capture-templates</code> the usual way<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list
 'org-capture-templates
 '("r" "RSS Feed" entry (file+headline "~/org/feeds.org" "Inbox")
   "*** %^C"
   :prepend t :immediate-finish t))

(add-to-list
 'org-capture-templates
 '("y" "YouTube Feed" entry (file+headline "~/org/feeds.org" "YouTube")
   "**** [[%^{Channel Feed URL}][%^{Channel Name}]]"
   :prepend t :immediate-finish t))
</pre>
</div>

<p>
Ta-da! Done for now, I'm satisfied. Though I can foresee the obvious extension
of integrating (the lately hotly contested) <a href="https://github.com/ytdl-org/youtube-dl">youtube-dl</a>. Maybe there's already
some extension? hmm, at least not on <code>melpa</code> or <code>gnu</code>.
</p>

<p>
Envision it so: a tag is specified in some way, when the specified tag is added
to a post (through <code>elfeed</code>), it is marked for download into a specified
directory. There, I've defined a new Emacs package! :)
</p>

<p>
There is already an Emacs interface to youtube-dl, <a href="https://gitlab.com/tuedachu/ytdl">ytdl</a>. If this, we'll call it
<code>elfeed-ytdl</code>, has the two packages as a dependency the actual code to achieve
this functionality is probably under fifty lines. Perhaps!
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Not really as depicted. I use <a href="https://github.com/jwiegley/use-package">use-package</a> because it rocks, but it's good
practice to keep code examples relevant and if possible, executable.
</p></div></div>


</div>
</div><div class="taglist"><a href="https://jasbrg.github.io/tags.html">Tags</a>: <a href="https://jasbrg.github.io/tag-emacs.html">emacs</a> <a href="https://jasbrg.github.io/tag-musing.html">musing</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
